---
title: SolidOptions
classe: Autodesk.Revit.DB.SolidOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# SolidOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 ExtraFaceAndEdgeHistoryKey { get; set; }` | `solidOptions.ExtraFaceAndEdgeHistoryKey` | Int32 |
| `ElementId GraphicsStyleId { get; set; }` | `solidOptions.GraphicsStyleId` | ElementId |
| `Boolean IsValidObject { get; }` | `solidOptions.IsValidObject` | Boolean |
| `ElementId MaterialId { get; set; }` | `solidOptions.MaterialId` | ElementId |
| `Void Dispose()` | `solidOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```